# 0. Data Load

In [2]:
import pandas as pd
import numpy as np

In [3]:
#data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
#df = pd.read_csv(data_url, sep='\s+', header=None)
#df.to_csv("housing.csv", index=False)

df = pd.read_csv('housing.csv')
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41,880,129.0,322,126,8.3252,452600,NEAR BAY
1,-122.22,37.86,21,7099,1106.0,2401,1138,8.3014,358500,NEAR BAY
2,-122.24,37.85,52,1467,190.0,496,177,7.2574,352100,NEAR BAY
3,-122.25,37.85,52,1274,235.0,558,219,5.6431,341300,NEAR BAY
4,-122.25,37.85,52,1627,280.0,565,259,3.8462,342200,NEAR BAY

# 1. Series

### 1) Series 생성하기

In [19]:
pd.Series?

In [2]:
data = [2, 4, 6, 8, 10]
series = pd.Series(data)
series

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [3]:
data = [2, 4, 6, 8, 10]
idx = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, dtype=np.float64, index=idx)
series

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
dtype: float64

### 2) Series 데이터 접근/할당

In [4]:
series

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
dtype: float64

###### <span style="color:blue">Example 1. Series </span>

In [25]:
# index c의 value

6.0

In [42]:
series.values

array([ 2.,  4.,  6.,  8., 10.])

In [43]:
series.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [35]:
# index c의 값 변경하기

In [36]:
series

a     2
b     4
c     c
d     8
e    10
dtype: object

### 3) 인덱서 loc, iloc

In [6]:
data = pd.Series(['a', 'b', 'c', 'd'], 
                 index = [1, 3, 5, 7])
data

1    a
3    b
5    c
7    d
dtype: object

#### 3-1. 인덱싱할 때 명시적인 인덱스 사용

###### <span style="color:blue">Example 2. loc</span>

In [7]:
# 인덱싱할때 명시적인 인덱스 사용 
data[3]

'b'

- loc 속성은 명시적인 인덱스를 참조하는 인덱싱과 슬라이싱을 가능하게 한다.

In [18]:
# index 1, 3, 5 값 가져오기

1    a
3    b
5    c
dtype: object

#### 3-2. 슬라이싱할 때 암묵적 인덱스를 사용

In [19]:
# 슬라이싱할때 암묵적 인덱스 사용 
data[1:3]

3    b
5    c
dtype: object

- iloc 속성은 인덱싱과 슬라이싱에서 언제나 암묵적인 파이썬 스타일의 인덱스를 참조하게 해준다

3    b
5    c
dtype: object

# 2. DataFrame

### 1) DataFrame 생성하기

In [47]:
pd.DataFrame?

In [61]:
raw_data = {'name' : ['Lee', 'Kim', 'Park'],
            'age'  : [23, 62, 35],
            'city' : ['Seoul', 'Jeju', 'Boston']}

df = pd.DataFrame(raw_data)
df

   age    city  name
0   23   Seoul   Lee
1   62    Jeju   Kim
2   35  Boston  Park

In [24]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx  = ['a', 'b', 'c']
            
df = pd.DataFrame(raw_data, columns=cols, index=idx)
df

   name  age    city
a   Lee   23   Seoul
b   Kim   62    Jeju
c  Park   35  Boston

### 2) Data 접근

In [56]:
df.name

0     Lee
1     Kim
2    Park
Name: name, dtype: object

In [53]:
df['name']

0     Lee
1     Kim
2    Park
Name: name, dtype: object

In [57]:
type(df['name'])

pandas.core.series.Series

###### <span style="color:blue">Example 3</span>

In [27]:
#'name', 'city'

   name    city
a   Lee   Seoul
b   Kim    Jeju
c  Park  Boston

In [58]:
type(df[['name', 'city']])

pandas.core.frame.DataFrame

### 3) 신규 컬럼 추가 및 데이터 할당

In [30]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
            
df = pd.DataFrame(raw_data, columns=cols)
df

   name  age    city
0   Lee   23   Seoul
1   Kim   62    Jeju
2  Park   35  Boston

###### <span style="color:blue">Example 4</span>

In [31]:
# 'debt' 신규 column 추가 


# age' 가 40 이상인 경우 'debt' 값이 True 아니면 False

   name  age    city   debt
0   Lee   23   Seoul  False
1   Kim   62    Jeju   True
2  Park   35  Boston  False

### 4) DataFrame 인덱싱/슬라이싱

In [33]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx  = [1, 5, 3]
            
df = pd.DataFrame(raw_data, columns=cols, index=idx)
df

   name  age    city
1   Lee   23   Seoul
5   Kim   62    Jeju
3  Park   35  Boston

#### 4-1. loc는 명시적 인덱스를 참조하는 인덱싱과 슬라이싱 가능

In [29]:
df.loc[3]

name      Park
age         35
city    Boston
Name: 3, dtype: object

###### <span style="color:blue">Example 5. loc</span>

In [36]:
# 1, 5 index에 해당하는 'name', 'age' 컬럼 출력

  name  age
1  Lee   23
5  Kim   62

#### 4-2. iloc는 인덱싱과 슬라이싱에서 암묵적으로 인덱스를 참조

In [33]:
df.iloc[2]

name      Park
age         35
city    Boston
Name: 3, dtype: object

###### <span style="color:blue">Example 6. iloc</span>

In [40]:
# index 0,1 및 column index 0,1 에 해당하는 컬럼 출력

  name  age
1  Lee   23
5  Kim   62

### 5) DataFrame 데이터 선택

In [64]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx = [1, 5, 3]

df = pd.DataFrame(raw_data, columns=cols, index=idx)

   name  age    city
1   Lee   23   Seoul
5   Kim   62    Jeju
3  Park   35  Boston

#### 5-1. Column 명으로 데이터 선택

In [65]:
df['name']

1     Lee
5     Kim
3    Park
Name: name, dtype: object

#### 5-2. column명 없이 사용하는 index number는 row 기준

In [66]:
df[:2]

  name  age   city
1  Lee   23  Seoul
5  Kim   62   Jeju

#### 5-3. column명과 함께 row index 사용하여 데이터 선택

In [67]:
df['name'][:2]

1    Lee
5    Kim
Name: name, dtype: object

In [68]:
df[:2]['name']

1    Lee
5    Kim
Name: name, dtype: object

In [69]:
df[['name', 'city']][:2]

  name   city
1  Lee  Seoul
5  Kim   Jeju

###### loc는 명시적 인덱스를 참조하는 인덱싱과 슬라이싱 가능

In [70]:
df.loc[:3, ['name','city']]

   name    city
1   Lee   Seoul
5   Kim    Jeju
3  Park  Boston

#### iloc는 인덱싱과 슬라이싱에서 암묵적으로 인덱스를 참조

In [71]:
df.iloc[:2, :2]

  name  age
1  Lee   23
5  Kim   62

### 6) Del, Drop

In [42]:
raw_data = [['Lee', 23, 'Seoul'],
            ['Kim', 62, 'Jeju'],
            ['Park', 35, 'Boston']]
cols = ['name', 'age', 'city']
idx = ['name', 'age', 'city']

df = pd.DataFrame(raw_data, columns=cols, index=idx)
df

      name  age    city
name   Lee   23   Seoul
age    Kim   62    Jeju
city  Park   35  Boston

#### 6-1. del

In [90]:
del df['name']
df

      age    city
name   23   Seoul
age    62    Jeju
city   35  Boston

#### 6-2. drop (axis 축 설정)

###### <span style="color:blue">Example 7. drop</span>

In [43]:
# column 'age' 정보 drop

      name    city
name   Lee   Seoul
age    Kim    Jeju
city  Park  Boston

In [44]:
# index 'age' 정보 drop

      name  age    city
name   Lee   23   Seoul
city  Park   35  Boston

In [45]:
# [주의] drop 후, df를 출력해도 데이터가 삭제되지 않음 ! 
df

      name  age    city
name   Lee   23   Seoul
age    Kim   62    Jeju
city  Park   35  Boston

In [46]:
# inplace=True 수행 시, df이 수정됨

      name    city
name   Lee   Seoul
age    Kim    Jeju
city  Park  Boston